{
    "No_tomar_las_cosas_personal": {
        "https://www.choosingtherapy.com/": {
            "how-to-not-take-things-personally/": {
                "text_extract": [
                    "Everyone is guilty of taking things too personally occasionally, especially when others’ words or actions are misinterpreted. While these reactions are natural, they can lead to strain in relationships and distort our perception of situations, and engaging in this behavior too often can cause strain on relationships with friends and family. The keys to breaking free from this cycle include understanding one’s own self-worth, separating facts from interpretations, and fostering open communication.",
                    "Relationships aren’t perfect. Navigate the ups and downs in therapy.",
                    "BetterHelp has over 20,000 licensed therapists who provide convenient and affordable online therapy. BetterHelp starts at $65 per week. Take a Free Online Assessment and get matched with the right therapist for you.",
                    "What Causes People to Take Things Personally?",
                    "Low self-esteem or low self-confidence are common conditions that make someone more likely to take others’ words or actions personally. When someone does not think highly of themselves, they are more likely to think that others also feel negatively about them.",
                    "There are many different reasons why some people might take things personally. For some, being overly concerned with reputation can make them become invested in how others see them, sometimes leading to frequent misinterpretations of others’ actions as personal.",
                    "Reasons why you may struggle with taking things too personally include:",
                    "Perfectionism: Perfectionism is when someone feels that they have to do or say everything perfectly. A perfectionist may take things too personally because they constantly worry that others are judging or criticizing them.",
                    "-",
                    "Low self-esteem: Low self-esteem can make someone more likely to take things personally because if we think poorly about ourselves, we can easily project these beliefs and feelings onto others, assuming that they are judging us.",
                    "-",
                    "Being highly sensitive: Being a highly sensitive person, or HSP, can make you more susceptible to others. This can come across as having an increased reaction to what others say and do, especially if you feel there was a “tone” or something else you picked up that others didn’t. HSPs are more sensitive to the little things, such as a change in voice or simple body language that others might not even notice.",
                    "-",
                    "Mean people surround you: Being in a toxic environment can make you more likely to take things personally, even around people who are not mean. If you are so used to others being unkind or sending mixed messages, you might interpret this same behavior in others.",
                    "-",
                    "Childhood neglect: Those who have survived childhood neglect are more likely to be sensitive to things such as perceived rejection, which likely comes from the decreased self-esteem in people with childhood emotional neglect.1 Childhood neglect significantly affects things such as anxiety, depression, and other mental health factors,2 which can all lead to taking things too personally.",
                    "-",
                    "You are neurodivergent: Those with neurodiverse traits, such as autism, Asperger’s, ADHD, and others, often struggle with understanding the intentions and meaning behind other people’s speech and actions. It is possible that those with neurodivergent traits can take things too personally if they do not understand the meaning or context.",
                    "-",
                    "Being overtired: A lack of sleep can significantly affect one’s ability to communicate effectively, including making it more likely for them to misinterpret others’ meanings behind their words or actions. “Sleep loss has been shown to cause impairments in a number of aspects central for successful communication…”3",
                    "-",
                    "Being stressed: Being stressed affects a person’s emotional reactivity, making it more likely that they will take things personally when they might not otherwise have had this sensitive reaction. Stress removes the ability to think objectively about things. “When someone is stressed, they may become frustrated or angry more easily.”4",
                    "-",
                    "Are Women More Prone to Taking Things Personally?",
                    "Due to how women are socialized in our society, women are more prone to taking things personally. According to research, girls and women are usually given less praise and recognition from a young age than men for the same- or similar- achievements and successes.5 Due to this, it can be common for women to feel “less than” others in the group, especially when in a group filled with men.",
                    "Likewise, women are more sensitive to others’ emotional expressions.6 Women might be more likely to pick up on someone’s annoyed or judgmental tone that their male peers might not pick up on. Of course, all genders have varying sensitivities to others’ emotions, but those socialized as female may be more likely to take things personally.",
                    "How to Know When You’re Taking Things Too Personally",
                    "Obsessing about others’ opinions of you and getting easily angered are signs that you are taking things too personally. It can be difficult to know when you are taking things too personally, especially if you are used to being oversensitive to others. But noticing when you are being too sensitive, and thus taking things too personally, is important to maintaining healthy boundaries and relationships.",
                    "Here are a few signs that you are taking things too personally:",
                    "You keep replaying someone’s critique of your work over and over again in your head",
                    "-",
                    "You are still thinking about an interaction with a person many hours after the event passed",
                    "-",
                    "You can feel your body getting warm and tense as you think about what they said or did",
                    "-",
                    "You are obsessed with others’ opinions and worry that they might be negative",
                    "-",
                    "You worry that there is an ulterior motive behind others’ words",
                    "-",
                    "You get angry or frustrated easily by others and find it difficult to let it go",
                    "-",
                    "You find yourself venting about the situation to other people for longer than necessary",
                    "-",
                    "You have struggled with feeling misunderstood for the more significant part of your life",
                    "-",
                    "Top Rated Online Therapy Services",
                    "BetterHelp – Best Overall",
                    "“BetterHelp is an online therapy platform that quickly connects you with a licensed counselor or therapist and earned 4 out of 5 stars.” Visit BetterHelp",
                    "Online-Therapy.com – Great Alternative",
                    "In addition to therapy, all Online-Therapy subscriptions include a self-guided CBT course. Visit Online-Therapy.com",
                    "Benefits of Taking Things Personally",
                    "Not unexpectedly, there are some possible benefits of recognizing that you are taking things personally. Being upset about something others have said or done tells you where your insecurities and sensitivities are.",
                    "When done respectfully, talking to friends and family about what bothered you can help them understand you better. Opening up to them can help them learn more about you and help you both deepen your relationship.",
                    "How to Stop Taking Things Personally",
                    "You can slowly shift your mindset by challenging your feelings and improving self-esteem to start learning how to stop taking things too personally. It is important to be mindful that change happens gradually, so you should not expect to change completely within a few days or weeks.",
                    "Instead, by following the guidelines below, you can expect to see changes over a few weeks or months.",
                    "Here are seven ways to stop taking things too personally:",
                    "1. Challenge Your Assumptions When You Feel Hurt",
                    "When you notice yourself becoming bothered by others’ actions or words, take a moment and challenge the thoughts in your head. By challenging the assumptions, you may recognize that you are assuming things to be true that might not be.",
                    "Here are a few questions that can help you challenge your assumptions:",
                    "“Was this done to me on purpose?”",
                    "-",
                    "“Is there a chance I am being oversensitive?”",
                    "-",
                    "“What is another explanation for their statement?”",
                    "-",
                    "Have I overreacted in the past about something similar?”",
                    "-",
                    "“Usually, this negative feeling will eventually pass- is it likely that this will pass as well?”",
                    "-",
                    "2. How Therapy Helps You Explore Insecurities",
                    "When people react sensitively to things, there is almost always a reason behind it. This could be an inner wound, trauma history, or something you are self-conscious about. Exploring these insecurities can help you learn not to take things so personally.",
                    "Here are a few effective therapy options to explore the insecurities that arise:",
                    "Psychodynamic therapy: Psychodynamic therapy works to explore someone’s insecurities by looking at the role of childhood traumas and other experiences. It is a great tool for examining how our past experiences might contribute to interpreting situations today.",
                    "-",
                    "Group therapy: If you want to learn more about improving social skills and self-awareness, group therapy can be very helpful. Many benefit from having a trusting and judgment-free space to explore emotions and sensitivities.",
                    "-",
                    "Cognitive behavior therapy (CBT): Cognitive Behavioral Therapy is a therapeutic tool that helps people develop awareness into how their thoughts could contribute to any sensitivities they are experiencing.",
                    "-",
                    "Dialectical behavioral therapy (DBT): For those who have experienced childhood trauma affecting their current relationships, DBT is a great tool for learning how to manage emotional reactions to situations and people.",
                    "-",
                    "Acceptance and commitment therapy (ACT): ACT is a modality that teaches people to expect and accept that there will be difficult feelings in some social situations. This method can help people learn how to navigate feelings of sensitivity, recognize when they are taking things too personally, and understand that the feeling will pass.",
                    "-",
                    "Relationships aren’t perfect. Navigate the ups and downs in therapy.",
                    "BetterHelp has over 20,000 licensed therapists who provide convenient and affordable online therapy. BetterHelp starts at $65 per week. Take a Free Online Assessment and get matched with the right therapist for you.",
                    "3. Work on Improving Self-Esteem",
                    "When your self-esteem is low, you are more likely to take things personally due to an overall assumption that others do not think highly of you. Working on your self-esteem can help decrease these negative reactions. Increasing self-esteem can help improve mental health and protect against negative perceptions or influences of others.7",
                    "4. Get Curious About the Insecurities That Arise",
                    "When you explore deeper into the feelings that arise, you may learn some things about yourself and your insecurities. This exploration can help you develop a greater self-awareness into yourself.",
                    "To begin, ask yourself the following questions:",
                    "“What does this person’s statement mean about me as a person?”",
                    "-",
                    "“Is their opinion of me MY opinion of me?”",
                    "-",
                    "“Who does their behavior remind me of? Does it seem familiar?”",
                    "-",
                    "“Do I tend to get sensitive about this same type of situation? Maybe there is a pattern that the universe is trying to show me.”",
                    "-",
                    "5. Look at the Positives",
                    "Being highly sensitive to others can be a positive trait. It shows you where your sensitivities are, and you can use this information to develop deeper relationships with others. Some believe being sensitive to external stimuli is a survival trait because it increases one’s responsiveness to environmental and social situations.8",
                    "6. What Is the Worst That It Could Mean?",
                    "If someone was trying to be offensive, this is their issue, not yours, which does not mean you are bad. Let’s say for a moment that the person did mean their statement to be offensive. What is the worst that could happen? We often convince ourselves that if someone doesn’t like us, it means that we are bad or unlikeable- but this isn’t true.",
                    "7. Allow the Feeling to Come and Go",
                    "Let the negative feelings come, and accept that they are a part of this reaction in this particular moment. Acknowledge the discomfort and any other negative or uncomfortable feelings or sensations. Remind yourself that it will eventually pass and that you are learning tools to minimize these reactions.",
                    "When to Seek Professional Support",
                    "If you cannot work through the stressors experienced from being oversensitive to others, you could benefit from working through these feelings with a therapist. Thankfully, many online therapy options and even an online therapist directory exist to help you find an appropriate professional to support you through these challenges.",
                    "If you are someone who occasionally takes things too personally, you can often manage by taking time to explore the emotions and thoughts that come up and working to develop greater self-awareness. However, sometimes, someone’s difficulties with taking things too personally interfere with their ability to develop or maintain social relationships – this is when you should consider finding a therapist.",
                    "In My Experience",
                    "I have suffered from social anxiety my whole adult life, and I also have elements of neurodivergence, such as sensory processing struggles and hypersensitivity as an HSP. Therefore, unintentionally taking things personally is a big part of my social experience.",
                    "In the past, I would become easily angered, and it affected my social relationships. Today, I can recognize my symptoms more easily and use this self-awareness to manage better when needed. This does not eliminate my tendency to take things personally, but it gives me the tools needed to climb out of the emotional stress more easily.",
                    "Additional Resources",
                    "To help our readers take the next step in their mental health journey, Choosing Therapy has partnered with leaders in mental health and wellness. Choosing Therapy is compensated for marketing by the companies included below.",
                    "Online Therapy",
                    "BetterHelp Get support and guidance from a licensed therapist. BetterHelp has over 20,000 therapists, who provide convenient and affordable online therapy. Complete a brief questionnaire and get matched with the right therapist for you. Get Started",
                    "Psychiatry, with you in mind",
                    "Talkiatry Our Psychiatrists Can Diagnose Your Condition, Prescribe Medication, And Monitor Your Progress. Most psychiatry visits cost patients $30 or less* Free Assessment",
                    "Drinking Moderation",
                    "Sunnyside Want to drink less? Sunnyside helps you ease into mindful drinking at your own pace. Think lifestyle change, not a fad diet. Develop new daily routines, so you maintain your new habits for life. Take a 3 Minute Quiz",
                    "Relationship Help",
                    "OurRelationship (Free Couples Course) OurRelationship has been proven to help couples improve communication, intimacy, and trust. 94% would recommend it to a friend. Get Started",
                    "Mental Health Support Group App",
                    "Circles Anytime, anonymous, and free. Never feel alone during life’s greatest challenges. Drop-in to live conversations and share thoughts, ask questions, or learn from others on the same journey. Join Circles Now",
                    "Free Prescription Discount Card",
                    "Optum Perks Save up to 80% on most prescriptions. Optum Perks provides discounts at over 64,000 pharmacies nationwide. No memberships or costs to you, ever. It’s really that easy. Get your card and start saving. Get the discount card!",
                    "*Includes copayment, deductible, coinsurance, and $0 Visits. Excludes no shows.",
                    "Online Anxiety Test",
                    "A few questions from Talkiatry can help you understand your symptoms and give you a recommendation for what to do next.",
                    "How Does ERP Help With Intrusive Thoughts?",
                    "Obsessive compulsive disorder (OCD) is a psychiatric condition marked by the presence of obsessive thoughts, images, doubts, or urges, followed by compulsive behaviors or acts aimed at easing the distress caused by the obsession. While the content of the obsessions can take many forms, they are always repetitive, persistent, involuntary, and intrusive, and they often result in a great deal of anxiety for the person experiencing them.",
                    "Find a therapist for relationship issues",
                    "Get the help you need from a therapist near you",
                    "City or zip Search"
                ],
                "idxs_advertisement": [
                    1,
                    2,
                    45,
                    46,
                    47,
                    48,
                    49,
                    83,
                    84,
                    110,
                    111,
                    112,
                    113,
                    114,
                    115,
                    116,
                    117,
                    118,
                    119,
                    120,
                    121,
                    122,
                    123,
                    124,
                    125,
                    126,
                    127,
                    128,
                    129,
                    130,
                    131
                ]
            }
        },
        "https://kcrelationshipinstitute.com/": {
            "five-strategies-to-avoid-taking-things-personally-in-your-relationships/": {
                "text_extract": [
                    "It sounds easy. Only a few words. “Don’t take it personally.” However, it can feel nearly impossible not to get offended by some of your partner’s thoughts, emotions, and behaviors!",
                    "Why Do We Take Things So Personally?",
                    "You aren’t crazy or too sensitive. You are human if you care about what those around you think. In intimate relationships, where your partner often feels like an extension of yourself, their every decision, sigh, word, or facial expression can seem deeply personal. Recognizing when we take things personally is crucial, as it sheds light on our triggers and how we affect each other. However, consistently interpreting our partner’s behavior as a personal attack or a reflection on us can become problematic in long-term romantic relationships because we have so many interactions to navigate. The ability to separate your thoughts, emotions, and behaviors from your partners is vital and allows for a healthy space to discuss differences and manage difficult situations effectively.",
                    "Here are five strategies to help you that can help you take things less personally in your relationship:",
                    "Give the benefit of the doubt.",
                    "-",
                    "One option you have is to ignore the big sigh your partner just made. Not every movement your partner makes must mean something to you. Extending the benefit of the doubt is easier when you are not in a conflict, yet you still have the power to decide what to perceive as a personal attack. You can continue doing whatever you are doing. That takes less energy than hooking onto whatever your partner did or said that seemed like an offensive strike.",
                    "Ask a clarifying question.",
                    "-",
                    "Sometimes, moving forward and ignoring your partner’s scoff is impossible. So, you should verify what your partner meant by it. Rather than immediately jumping down their throat, it might be helpful to ask, “Hey cutie, what did you mean when you said?” or “That was a big deep breath. Is there anything you hope I take from that?” Put the ball in their court rather than leaping full throttle into an assumption that ends up riling you up and starting an unnecessary argument.",
                    "Check in with compassion.",
                    "-",
                    "Taking a clarifying question further, you can check with your partner to see if they are doing alright. They could say something snappy, and instead of automatically deciding that they are out to get you, it can help to see if they are having a tough time. That might sound like, “You sound a bit annoyed with me. Is it me, or was there something about your day that felt tough that you’d like to talk about?” You sought clarification in just a straightforward sentence and inclusively engaged your partner.",
                    "Manage your own internal experience.",
                    "-",
                    "Another option is to deal with the moment through self-soothing, self-validation, and perspective-taking. You may seek a more compassionate view. You might know your partner has been dealing with a challenging work project, which can help you extend some grace. Sometimes, you might not be able to let go of the belief that it was an intentional dig from your partner. In such instances, it’s essential to recognize and address your frustration. Try saying, “I found what my partner said hurtful, yet I don’t believe it’s significant enough to discuss further or seek additional reassurance.” Learning to value and comfort yourself when hurt is crucial for nurturing relationships.",
                    "Let them know that they impacted you.",
                    "-",
                    "Understandably, you will experience moments when it does feel important to let your partner know they’ve hurt you or that you feel misunderstood. However, it isn’t helpful to go into either defense mode or launch a counter-attack that will likely put them on the defensive. Instead, it can help to address the issue promptly (not five weeks later) by expressing how their actions affected you. Think of those “I-statements” that take the format of “I felt X (specific emotion) when you did Y (specific action) in Z situation (specific context).” Your partner may not respond ideally, but you increase your chances of being heard if you share that way rather than hurling back, “What the hell was that look for?!?”",
                    "These strategies won’t immediately erase your natural tendency to take things personally. However, they can help slow your reactions, promoting greater understanding and effectiveness as a partner. We often perceive events as centered around us due to our immersion in personal experiences. However, recognizing that our partners have their own unique lives, influenced by many factors not related to us, can significantly improve our relationships."
                ],
                "idxs_advertisement": []
            }
        },
        "https://www.psychologytoday.com/": {
            "us/blog/how-be-yourself/202011/6-ways-not-take-things-personally": {
                "text_extract": [
                    "Career",
                    "6 Ways to Not Take Things Personally",
                    "Walk the line between overreacting and underreacting.",
                    "Posted November 17, 2020 Reviewed by Abigail Fagan",
                    "Every one of us has a tender underbelly of our psyche. Everyone has something they’re sensitive about, where even a gentle poke can feel more like a thwack. Comments don’t slide off like water from a duck’s back; rather, we feel more like a sitting duck.",
                    "But criticism is an inevitable part of life, and hearing reasonable negative feedback without overreacting is a life skill. If we can hear fair criticism of our actions without taking it personally, not only do we escape feeling hurt or shamed, we also keep criticism from escalating. By contrast, if we think, “You hurt my feelings so I’ll hurt you back,” we create more conflict and pain all around.",
                    "So how can we take things less personally, both to benefit ourselves and others? How can we toughen up without becoming hard-hearted?",
                    "Let’s start with two tips about how to re-interpret the critic, whether it’s your boss, your mother-in-law, your nosy neighbor, or someone you love and trust. In fact, that’s the crux of the matter.",
                    "1. Consider the source.",
                    "Would you be as likely to drink water from a mountain spring as from a puddle under a dumpster? Of course not. But why? Aside from the fact that you are smart, it’s because the source matters.",
                    "The same thing goes for criticism. Does the critique come from someone you like and respect? Does this person know you well? Or is this someone known to shoot off their mouth, have all the subtlety of a sledgehammer, or has never had an authentic interaction with you?",
                    "In short, you’d take criticism very differently if it was presented with care from someone you trust versus shouted from a moving car. Consider the source, which will help you decide whether to take their feedback to heart or with a big grain of salt.",
                    "2. Give critics another chance, but not unlimited chances.",
                    "People say mean things. People can be dumb. People have no filter. It’s only human to make a mistake and say something critical or insulting, but if it happens again and again, it’s not a mistake anymore, it’s a pattern.",
                    "To paraphrase, critique me once, that’s on you. Critique me twice, that’s on me. But if you’re repeatedly insulted without apology or acknowledgment, it’s time to speak up and/or limit contact. Three strikes and you’re not necessarily out, especially if you still have to work with or be related to them, but it’s definitely time to draw some boundaries.",
                    "Next up, four tips about how to work on ourselves to take the sting out of criticism. As they say, the only person you can change is you.",
                    "3. Heed the double-edged sword of “They shouldn’t say that!”",
                    "Individuals hypersensitive to criticism often have high moral standards. They have a strict moral code and their values run deep. And that’s a good thing. But this is one of the few places where strong values can have a downside. “How dare they say that!” “That’s wrong!” “She can’t say that!” “That’s not how things should be.” All those things may be true, but whatever statement hurt you was still uttered.",
                    "The fact that the critic “shouldn’t” or “can’t” is moot. Pretend a dog just deposited a steaming bundle right next to your “please pick up after your pet” sign. It shouldn’t have happened, but you have to deal with it nonetheless.",
                    "Getting unfair or undue criticism is similar. Even if it “shouldn’t” be there, you still have to deal with it. Feeling annoyed and offended may be warranted, but it’s not helpful. Remember that even if you walk the line and follow the rules, you can’t control whether others break them. In short, focus your attention on the content of the criticism, not whether or not it should have happened.",
                    "4. Question your own perfectionism.",
                    "There is a straight line between hypersensitivity and perfectionism. Individuals who take things personally often work really hard to be blameless, flawless, or excellent precisely so no one will criticize them. When they get negative feedback, it feels like it blows away all they’ve worked so hard for.",
                    "If this sounds familiar, you can reframe this in a few ways. One is to incorporate getting better at hearing criticism into your perfectionism. Get better at receiving feedback. Aim higher when it comes to dealing with commentary. Be an overachiever when it comes to facing the haters.",
                    "Another, more challenging way, is to change your perfectionism. Dare to accept your cracks and warts. Slowly realizing that you are enough just as you are takes time and work, but simply acknowledging your buttons can be a powerful first step. If you were bullied in the past, you may be hypersensitive to comments that remind you of being thrown against your middle school locker. If you were pigeonholed by your parents as being the dumb one, the crazy one, or the problem child, you may have worked your butt off to prove that you’re anything but.",
                    "Any critique that brings forth old hurts cuts extra deep, but just being aware that something is a hot button issue for you is the first step to owning it, and eventually healing it.",
                    "5. “I should’ve said…!” Be honest with yourself when recreating scenes in your head.",
                    "We’ve all experienced getting bullied or criticized and then, hours later, coming up with a good zinger we wish we had said in the moment. We replay the scene in our head, spinning out what we wanted to have happened instead of what actually went down.",
                    "But replaying scenes in your head is a two-sided coin. In some cases, it can be extremely helpful. If you replay the scene and imagine getting what you needed in the moment—feeling empowered, soothed, or safe, it can be an extremely worthwhile daydream. In fact, when done with a qualified therapist, this is called imagery rescripting, and is a cutting-edge tool in treating trauma survivors.",
                    "However, in other cases replaying a scene can be problematic; specifically, imagining revenge fantasies. At that point, reimagining crosses the line from empowering to egotistical.",
                    "In fact, a study out of Louisiana State University found a link between how frequently people re-imagined interactions and covert narcissism, the version of narcissism associated with low self-esteem rather than I-am-the-greatest grandiosity. Covert narcissism is the unenviable mix of being vulnerable and self-absorbed at the same time.",
                    "The researchers found that frequently imagining scenes that were discrepant with reality—fantasizing about humiliating the ex you never see anymore, or imagining dressing down your boss and staging a power grab—was tied to covert narcissism. Turns out covert narcissists envision conflict more often than non-narcissists and, in addition, imagine themselves dominating the interaction and controlling the relationship.",
                    "So be aware when you replay those scenes in your head. If you’re doing it to soothe and empower yourself, carry on. But if you’re doing it to dominate your imagined enemy, consider trying out a healthier coping strategy instead.",
                    "6. Toe the line between taking things personally and being personally invested.",
                    "To wrap things up, we’ll do something surprising: we’ll defend taking things personally. Now, “taking things personally” usually brings to mind images of silent fuming or screaming into our pillow, but there’s something to be said for taking things to heart.",
                    "The opposite of taking things personally is to depersonalize them. And when you depersonalize an action or a role, it quickly loses its value. Taking your job personally means being invested, while depersonalizing it means showing up only for a paycheck. Taking a passion personally means being engaged, while detaching guarantees lackluster results at best.",
                    "To take things even further, with your fellow humans, taking things personally means engaging with others at your best. Not taking things personally, at worst, leads to dehumanization and moral disengagement—convincing yourself that ethical standards and other people don’t matter.",
                    "So, oddly, let things get to you. Take them personally, in the best possible way. Find a happy medium between being hypersensitive and caring deeply. All in all, take your work and relationships extremely personally. After all, this messy, imperfect, glorious life of yours belongs to you.",
                    "Facebook/LinkedIn images: fizkes/Shutterstock"
                ],
                "idxs_advertisement": []
            }
        },
        "https://hbr.org/": {
            "2023/10/how-to-stop-taking-work-so-personally": {
                "text_extract": [],
                "idxs_advertisement": []
            }
        },
        "https://tinybuddha.com/": {
            "blog/avoid-feeling-bad-how-to-stop-taking-things-personally/": {
                "text_extract": [
                    "“There is a huge amount of freedom that comes when you take nothing personally.” ~Don Miguel Ruiz",
                    "Oh man, if I had a dollar for every time I took something personally…",
                    "I’d be rich by now.",
                    "When I quit my corporate job in Paris and took a year off traveling people would often ask me, “So, what’s your plan now?” A normal question to ask, I know. But back then, I usually got offended by that question and other follow-up ones. It made me think that others were judging my decision and questioning my ability to change career paths.",
                    "Or when I was single and people would ask, “So, are you seeing anyone right now?” Again, I’d often assume that they thought less of me if I didn’t have an interesting single life or wasn’t dating someone special.",
                    "Or in the early days of dating my boyfriend, when he wouldn’t have time to talk or see me at times, I’d take it personally and assume the worst. Maybe I had done something to mess everything up. Maybe he didn’t think I was that interesting after all.",
                    "Taking things personally is emotionally draining. It often makes you assume the worst and puts you into the victim corner. Sometimes, of course, it’s worth reflecting on our own behavior, which can help us develop and grow as individuals. But taking things personally, when many times they’re not, just tears down our self-esteem and makes us question ourselves.",
                    "Here are a few ways to stop taking things personally:",
                    "1. Question your negative beliefs.",
                    "When we take things personally, it’s often because we hold a negative belief that is fueling our perception of a situation. For example, if you say “hello” to an acquaintance on the street and get upset because they don’t reply back, you might believe that people who don’t acknowledge you are rude or that they have something against you.",
                    "Look at the limiting belief behind the situation and question it. Maybe they didn’t actually see you. Maybe they didn’t have time to perceive that it was you who passed by. Or maybe they were simply too occupied in their own mind to engage with anyone else.",
                    "Many times, our beliefs make us misinterpret situations negatively and turn them against ourselves. We form negative assumptions and inevitably feel hurt if we don’t take the time to question our thoughts and beliefs.",
                    "2. Don’t assume you know everything.",
                    "When I left my job to travel for a year and get clear on what business to start, I was scared of what others, especially colleagues I respected, would think of me. I simply assumed that they would think I was irresponsible for leaving a good career for… well, I didn’t know yet.",
                    "There was one colleague in particular, who I really looked up to, that I already had assumed judged me for my decision. Whenever she mentioned something about her career, I turned that against myself as a way of confirming “I knew it, she thinks I’ve made a terrible mistake.”",
                    "Then one day, when we were talking about my journey and the choices I had made, she said, “You know Maria, I think you’re so brave. I wish I had the courage to also quit and pursue my own business.” This proved to me that we don’t know what others are thinking about us, even if we think we do. So don’t assume you know everything.",
                    "3. Know that it’s not about you.",
                    "When someone seems harsh or insensitive it’s easy to assume it’s personal. But often, it’s really not. Someone who’s rude to you in traffic might have had a terrible morning. Someone who makes a condescending comment might struggle with their own self-esteem and self-confidence. Someone who’s cold and short in their communication might be really stressed.",
                    "It’s worth reflecting on what we can learn when it comes to things we take personally. In my experience, there’s always a lesson. Try to extract it and then leave the rest.",
                    "For example, when I started a podcast, a friend sent me a picture over Instagram with the message “Women doing podcasts just found a substitute for therapy.” It was supposed to be funny, but it wasn’t to me.",
                    "My learning in that situation was to care more about what I wanted to do instead of one other person’s opinion (or joke). (And I’m happy I’ve continued because, since then, we’ve received so much positive feedback on the podcast!)",
                    "4. Create a counter-story.",
                    "Often, when we take something personally, it’s because it confirms a negative story we have running in the back of our mind. For example, if someone in your family makes a joke or comment about you being messy or having limited cooking skills—and you regularly tell yourself that you’re somehow inferior to others because of these things—you might get offended.",
                    "So, what should you do? Create an empowering counter story. Maybe you’re a bit messy, but so what? You might also be really creative. And maybe you’re not so great at cooking, but you have other skills—for example, you’re the one who always sorts out conflicts between people.",
                    "In short, tell a story that benefits you and remember that we all have flaws, quirks, imperfections, and weaknesses. Needless to say, if you don’t like your behavior, then of course, you have the power to change it. But sometimes you simply need to accept that you are who you are, and there’s nothing wrong with that.",
                    "5. Accept that we’re all different (and not everyone needs to like you).",
                    "You might be taking something personally because this gives you a greater chance of getting someone’s approval. If it’s about you, then there’s something you can do about it. If it’s about them, then it’s truly out of your hands, and all you can do is accept that, for whatever reason, they don’t like you or won’t let you in.",
                    "No single person on this planet is liked by everyone. That’s just part of life, for all of us. Instead of trying to change yourself to be liked by someone, shift your focus and ask yourself why you need this person’s approval. Is it that you’re uncomfortable with disapproval in general, or do you want them to like you for other reasons, such as they are a friend of a friend?",
                    "When you identify the root cause of your discomfort with their disapproval, you’ll be able to tell yourself what you need to hear to let it go—for example, that their opinion doesn’t mean anything about you as a person.",
                    "6. Create space between an “offense” and your reaction.",
                    "When we take something personally, it’s easy to lash out in anger, frustration, or pain, which only makes things worse. Before you step into action, try creating some space between the situation and your reaction. Breathe, step away, and allow yourself to calm down before acting out.",
                    "Maybe you interpreted the situation in a negative way. Maybe this person wasn’t judging or being condescending toward you. Maybe there’s something you don’t know about the situation. Try not to react to the situation, but to respond once you have calmed down. Perhaps with a little time and space you’ll recognize your initial conclusions were wrong.",
                    "7. Ask for clarification.",
                    "If you know the person who said or did something that made you feel bad, ask for clarification. What did he or she really mean? What was his or her intention? Many times, we interpret situations negatively. But in my experience, after asking for clarification, we realize the other person didn’t intend to hurt us.",
                    "So instead of letting your thoughts spin off in a negative direction, ask the person to spell out what he or she really meant. You may be surprised by the number of times you learn that you completely misread a situation.",
                    "8. Practice self-compassion.",
                    "This is what it all comes down to, isn’t it? Practicing self-compassion when we’re being hard on ourselves. Because even though someone else might say or do something to offend us, we’re the ones who decide how we let their behavior affect us. We can always choose not to take negative comments to heart or get down on ourselves just because someone else was rude or insensitive.",
                    "Practice saying, “I’m not letting that in” to draw a clear line when you’ve decided not to take something personally.",
                    "Whether you misinterpreted a situation or someone actually was rude to you, you decide whether to invite it in or not. So stand guard to the door of your mind. Keep a high standard and make sure to let in words, thoughts, and beliefs that empower and strengthen you.",
                    "About Maria Stenvinkel",
                    "Maria Stenvinkel is on a mission to help you move from fear to fearless—and to unleash your confidence, greater potential, and true self-love. Download her free and powerful worksheet: \"The Secret to Boosting Your Self-Confidence [Easy Worksheet].\""
                ],
                "idxs_advertisement": []
            }
        }
    },
    "politica": {
        "https://www.lasillavacia.com/": {
            "category/quien-es-quien/": {
                "text_extract": [],
                "idxs_advertisement": []
            }
        }
    }
}