{
    "No_tomar_las_cosas_personal": {
        "https://www.choosingtherapy.com/": {
            "how-to-not-take-things-personally/": {
                "text_extract": [
                    "Everyone is guilty of taking things too personally occasionally, especially when others’ words or actions are misinterpreted. While these reactions are natural, they can lead to strain in relationships and distort our perception of situations, and engaging in this behavior too often can cause strain on relationships with friends and family. The keys to breaking free from this cycle include understanding one’s own self-worth, separating facts from interpretations, and fostering open communication.",
                    "Relationships aren’t perfect. Navigate the ups and downs in therapy.",
                    "BetterHelp has over 20,000 licensed therapists who provide convenient and affordable online therapy. BetterHelp starts at $65 per week. Take a Free Online Assessment and get matched with the right therapist for you.",
                    "What Causes People to Take Things Personally?",
                    "Low self-esteem or low self-confidence are common conditions that make someone more likely to take others’ words or actions personally. When someone does not think highly of themselves, they are more likely to think that others also feel negatively about them.",
                    "There are many different reasons why some people might take things personally. For some, being overly concerned with reputation can make them become invested in how others see them, sometimes leading to frequent misinterpretations of others’ actions as personal.",
                    "Reasons why you may struggle with taking things too personally include:",
                    "Perfectionism: Perfectionism is when someone feels that they have to do or say everything perfectly. A perfectionist may take things too personally because they constantly worry that others are judging or criticizing them.",
                    "-",
                    "Low self-esteem: Low self-esteem can make someone more likely to take things personally because if we think poorly about ourselves, we can easily project these beliefs and feelings onto others, assuming that they are judging us.",
                    "-",
                    "Being highly sensitive: Being a highly sensitive person, or HSP, can make you more susceptible to others. This can come across as having an increased reaction to what others say and do, especially if you feel there was a “tone” or something else you picked up that others didn’t. HSPs are more sensitive to the little things, such as a change in voice or simple body language that others might not even notice.",
                    "-",
                    "Mean people surround you: Being in a toxic environment can make you more likely to take things personally, even around people who are not mean. If you are so used to others being unkind or sending mixed messages, you might interpret this same behavior in others.",
                    "-",
                    "Childhood neglect: Those who have survived childhood neglect are more likely to be sensitive to things such as perceived rejection, which likely comes from the decreased self-esteem in people with childhood emotional neglect.1 Childhood neglect significantly affects things such as anxiety, depression, and other mental health factors,2 which can all lead to taking things too personally.",
                    "-",
                    "You are neurodivergent: Those with neurodiverse traits, such as autism, Asperger’s, ADHD, and others, often struggle with understanding the intentions and meaning behind other people’s speech and actions. It is possible that those with neurodivergent traits can take things too personally if they do not understand the meaning or context.",
                    "-",
                    "Being overtired: A lack of sleep can significantly affect one’s ability to communicate effectively, including making it more likely for them to misinterpret others’ meanings behind their words or actions. “Sleep loss has been shown to cause impairments in a number of aspects central for successful communication…”3",
                    "-",
                    "Being stressed: Being stressed affects a person’s emotional reactivity, making it more likely that they will take things personally when they might not otherwise have had this sensitive reaction. Stress removes the ability to think objectively about things. “When someone is stressed, they may become frustrated or angry more easily.”4",
                    "-",
                    "Are Women More Prone to Taking Things Personally?",
                    "Due to how women are socialized in our society, women are more prone to taking things personally. According to research, girls and women are usually given less praise and recognition from a young age than men for the same- or similar- achievements and successes.5 Due to this, it can be common for women to feel “less than” others in the group, especially when in a group filled with men.",
                    "Likewise, women are more sensitive to others’ emotional expressions.6 Women might be more likely to pick up on someone’s annoyed or judgmental tone that their male peers might not pick up on. Of course, all genders have varying sensitivities to others’ emotions, but those socialized as female may be more likely to take things personally.",
                    "How to Know When You’re Taking Things Too Personally",
                    "Obsessing about others’ opinions of you and getting easily angered are signs that you are taking things too personally. It can be difficult to know when you are taking things too personally, especially if you are used to being oversensitive to others. But noticing when you are being too sensitive, and thus taking things too personally, is important to maintaining healthy boundaries and relationships.",
                    "Here are a few signs that you are taking things too personally:",
                    "You keep replaying someone’s critique of your work over and over again in your head",
                    "-",
                    "You are still thinking about an interaction with a person many hours after the event passed",
                    "-",
                    "You can feel your body getting warm and tense as you think about what they said or did",
                    "-",
                    "You are obsessed with others’ opinions and worry that they might be negative",
                    "-",
                    "You worry that there is an ulterior motive behind others’ words",
                    "-",
                    "You get angry or frustrated easily by others and find it difficult to let it go",
                    "-",
                    "You find yourself venting about the situation to other people for longer than necessary",
                    "-",
                    "You have struggled with feeling misunderstood for the more significant part of your life",
                    "-",
                    "Top Rated Online Therapy Services",
                    "BetterHelp – Best Overall",
                    "“BetterHelp is an online therapy platform that quickly connects you with a licensed counselor or therapist and earned 4 out of 5 stars.” Visit BetterHelp",
                    "Online-Therapy.com – Great Alternative",
                    "In addition to therapy, all Online-Therapy subscriptions include a self-guided CBT course. Visit Online-Therapy.com",
                    "Benefits of Taking Things Personally",
                    "Not unexpectedly, there are some possible benefits of recognizing that you are taking things personally. Being upset about something others have said or done tells you where your insecurities and sensitivities are.",
                    "When done respectfully, talking to friends and family about what bothered you can help them understand you better. Opening up to them can help them learn more about you and help you both deepen your relationship.",
                    "How to Stop Taking Things Personally",
                    "You can slowly shift your mindset by challenging your feelings and improving self-esteem to start learning how to stop taking things too personally. It is important to be mindful that change happens gradually, so you should not expect to change completely within a few days or weeks.",
                    "Instead, by following the guidelines below, you can expect to see changes over a few weeks or months.",
                    "Here are seven ways to stop taking things too personally:",
                    "1. Challenge Your Assumptions When You Feel Hurt",
                    "When you notice yourself becoming bothered by others’ actions or words, take a moment and challenge the thoughts in your head. By challenging the assumptions, you may recognize that you are assuming things to be true that might not be.",
                    "Here are a few questions that can help you challenge your assumptions:",
                    "“Was this done to me on purpose?”",
                    "-",
                    "“Is there a chance I am being oversensitive?”",
                    "-",
                    "“What is another explanation for their statement?”",
                    "-",
                    "Have I overreacted in the past about something similar?”",
                    "-",
                    "“Usually, this negative feeling will eventually pass- is it likely that this will pass as well?”",
                    "-",
                    "2. How Therapy Helps You Explore Insecurities",
                    "When people react sensitively to things, there is almost always a reason behind it. This could be an inner wound, trauma history, or something you are self-conscious about. Exploring these insecurities can help you learn not to take things so personally.",
                    "Here are a few effective therapy options to explore the insecurities that arise:",
                    "Psychodynamic therapy: Psychodynamic therapy works to explore someone’s insecurities by looking at the role of childhood traumas and other experiences. It is a great tool for examining how our past experiences might contribute to interpreting situations today.",
                    "-",
                    "Group therapy: If you want to learn more about improving social skills and self-awareness, group therapy can be very helpful. Many benefit from having a trusting and judgment-free space to explore emotions and sensitivities.",
                    "-",
                    "Cognitive behavior therapy (CBT): Cognitive Behavioral Therapy is a therapeutic tool that helps people develop awareness into how their thoughts could contribute to any sensitivities they are experiencing.",
                    "-",
                    "Dialectical behavioral therapy (DBT): For those who have experienced childhood trauma affecting their current relationships, DBT is a great tool for learning how to manage emotional reactions to situations and people.",
                    "-",
                    "Acceptance and commitment therapy (ACT): ACT is a modality that teaches people to expect and accept that there will be difficult feelings in some social situations. This method can help people learn how to navigate feelings of sensitivity, recognize when they are taking things too personally, and understand that the feeling will pass.",
                    "-",
                    "Relationships aren’t perfect. Navigate the ups and downs in therapy.",
                    "BetterHelp has over 20,000 licensed therapists who provide convenient and affordable online therapy. BetterHelp starts at $65 per week. Take a Free Online Assessment and get matched with the right therapist for you.",
                    "3. Work on Improving Self-Esteem",
                    "When your self-esteem is low, you are more likely to take things personally due to an overall assumption that others do not think highly of you. Working on your self-esteem can help decrease these negative reactions. Increasing self-esteem can help improve mental health and protect against negative perceptions or influences of others.7",
                    "4. Get Curious About the Insecurities That Arise",
                    "When you explore deeper into the feelings that arise, you may learn some things about yourself and your insecurities. This exploration can help you develop a greater self-awareness into yourself.",
                    "To begin, ask yourself the following questions:",
                    "“What does this person’s statement mean about me as a person?”",
                    "-",
                    "“Is their opinion of me MY opinion of me?”",
                    "-",
                    "“Who does their behavior remind me of? Does it seem familiar?”",
                    "-",
                    "“Do I tend to get sensitive about this same type of situation? Maybe there is a pattern that the universe is trying to show me.”",
                    "-",
                    "5. Look at the Positives",
                    "Being highly sensitive to others can be a positive trait. It shows you where your sensitivities are, and you can use this information to develop deeper relationships with others. Some believe being sensitive to external stimuli is a survival trait because it increases one’s responsiveness to environmental and social situations.8",
                    "6. What Is the Worst That It Could Mean?",
                    "If someone was trying to be offensive, this is their issue, not yours, which does not mean you are bad. Let’s say for a moment that the person did mean their statement to be offensive. What is the worst that could happen? We often convince ourselves that if someone doesn’t like us, it means that we are bad or unlikeable- but this isn’t true.",
                    "7. Allow the Feeling to Come and Go",
                    "Let the negative feelings come, and accept that they are a part of this reaction in this particular moment. Acknowledge the discomfort and any other negative or uncomfortable feelings or sensations. Remind yourself that it will eventually pass and that you are learning tools to minimize these reactions.",
                    "When to Seek Professional Support",
                    "If you cannot work through the stressors experienced from being oversensitive to others, you could benefit from working through these feelings with a therapist. Thankfully, many online therapy options and even an online therapist directory exist to help you find an appropriate professional to support you through these challenges.",
                    "If you are someone who occasionally takes things too personally, you can often manage by taking time to explore the emotions and thoughts that come up and working to develop greater self-awareness. However, sometimes, someone’s difficulties with taking things too personally interfere with their ability to develop or maintain social relationships – this is when you should consider finding a therapist.",
                    "In My Experience",
                    "I have suffered from social anxiety my whole adult life, and I also have elements of neurodivergence, such as sensory processing struggles and hypersensitivity as an HSP. Therefore, unintentionally taking things personally is a big part of my social experience.",
                    "In the past, I would become easily angered, and it affected my social relationships. Today, I can recognize my symptoms more easily and use this self-awareness to manage better when needed. This does not eliminate my tendency to take things personally, but it gives me the tools needed to climb out of the emotional stress more easily.",
                    "Additional Resources",
                    "To help our readers take the next step in their mental health journey, Choosing Therapy has partnered with leaders in mental health and wellness. Choosing Therapy is compensated for marketing by the companies included below.",
                    "Online Therapy",
                    "BetterHelp Get support and guidance from a licensed therapist. BetterHelp has over 20,000 therapists, who provide convenient and affordable online therapy. Complete a brief questionnaire and get matched with the right therapist for you. Get Started",
                    "Psychiatry, with you in mind",
                    "Talkiatry Our Psychiatrists Can Diagnose Your Condition, Prescribe Medication, And Monitor Your Progress. Most psychiatry visits cost patients $30 or less* Free Assessment",
                    "Drinking Moderation",
                    "Sunnyside Want to drink less? Sunnyside helps you ease into mindful drinking at your own pace. Think lifestyle change, not a fad diet. Develop new daily routines, so you maintain your new habits for life. Take a 3 Minute Quiz",
                    "Relationship Help",
                    "OurRelationship (Free Couples Course) OurRelationship has been proven to help couples improve communication, intimacy, and trust. 94% would recommend it to a friend. Get Started",
                    "Mental Health Support Group App",
                    "Circles Anytime, anonymous, and free. Never feel alone during life’s greatest challenges. Drop-in to live conversations and share thoughts, ask questions, or learn from others on the same journey. Join Circles Now",
                    "Free Prescription Discount Card",
                    "Optum Perks Save up to 80% on most prescriptions. Optum Perks provides discounts at over 64,000 pharmacies nationwide. No memberships or costs to you, ever. It’s really that easy. Get your card and start saving. Get the discount card!",
                    "*Includes copayment, deductible, coinsurance, and $0 Visits. Excludes no shows.",
                    "Online Anxiety Test",
                    "A few questions from Talkiatry can help you understand your symptoms and give you a recommendation for what to do next.",
                    "How Does ERP Help With Intrusive Thoughts?",
                    "Obsessive compulsive disorder (OCD) is a psychiatric condition marked by the presence of obsessive thoughts, images, doubts, or urges, followed by compulsive behaviors or acts aimed at easing the distress caused by the obsession. While the content of the obsessions can take many forms, they are always repetitive, persistent, involuntary, and intrusive, and they often result in a great deal of anxiety for the person experiencing them.",
                    "Find a therapist for relationship issues",
                    "Get the help you need from a therapist near you",
                    "City or zip Search"
                ],
                "idxs_advertisement": [
                    1,
                    2,
                    45,
                    46,
                    47,
                    48,
                    49,
                    83,
                    84,
                    110,
                    111,
                    112,
                    113,
                    114,
                    115,
                    116,
                    117,
                    118,
                    119,
                    120,
                    121,
                    122,
                    123,
                    124,
                    125,
                    126,
                    127,
                    128,
                    129,
                    130,
                    131
                ]
            }
        }
    },
    "politica": {
        "https://www.lasillavacia.com/": {
            "category/quien-es-quien/": {
                "text_extract": [],
                "idxs_advertisement": []
            }
        }
    }
}